app/controllers/tests_controller.rb

  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save
---
INSERT INTO "tests" ("name", "result", "animal_id", "veterinarian_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["result", "a"], ["animal_id", 1], ["veterinarian_id", 1], ["created_at", "2022-11-22 13:01:43.552086"], ["updated_at", "2022-11-22 13:01:43.552086"]]

  def update
    respond_to do |format|
      if @test.update(test_params)
---
UPDATE "tests" SET "name" = ?, "updated_at" = ? WHERE "tests"."id" = ?  [["name", "aa"], ["updated_at", "2022-11-22 13:01:55.542708"], ["id", 2]]

  def destroy
    @test.destroy
---
DELETE FROM "tests" WHERE "tests"."id" = ?  [["id", 1]]