app/controllers/veterinarians_controller.rb

SELECT "veterinarians".* FROM "veterinarians"
---
  def index
    @veterinarians = Veterinarian.all

INSERT INTO "veterinarians" ("name", "status", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hannah"], ["status", "FRee"], ["number", "525428914"], ["created_at", "2022-11-21 17:26:47.035424"], ["updated_at", "2022-11-21 17:26:47.035424"]]
---
  def create
    @veterinarian = Veterinarian.new(veterinarian_params)

    respond_to do |format|
      if @veterinarian.save

UPDATE "veterinarians" SET "name" = ?, "admin" = ?, "number" = ?, "updated_at" = ? WHERE "veterinarians"."id" = ?  [["name", "Hannaha"], ["admin", 1], ["number", "5254289142345"], ["updated_at", "2022-11-21 17:26:54.179269"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @veterinarian.update(veterinarian_params)

DELETE FROM "veterinarians" WHERE "veterinarians"."id" = ?  [["id", 1]]
---
  def destroy
    @veterinarian.destroy

SELECT "veterinarians".* FROM "veterinarians" WHERE "veterinarians"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_veterinarian
    @veterinarian = Veterinarian.find(params[:id])